---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableGenerateTrussByFamilyAndOrientation
source: html/50594536-48c7-d8a0-1fae-f826f9119b50.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableGenerateTrussByFamilyAndOrientation Property

Revit is unable to generate a truss using the current Layout Family and Truss orientation.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableGenerateTrussByFamilyAndOrientation { get; }
```